def file_search(folder, filename):
    # якщо поточний файл або папка є шуканим, повертаємо його назву
    if folder == filename:
        return filename
    # інакше
    else:
        # перевіряємо, це файл або папка
        if isinstance(folder, list):
            # назва папки зберігається в 0-му елементі, тож треба його перевірити
            # якщо це те, що ми шукаємо, повернути назву
            if folder[0] == filename:
                return filename
            # інакше перебираємо весь вміст папки, тепер ігноруючи 0-й елемент
            for i in folder[1:]:
                # для кожного елементу рекурсивно запускаємо цю ж функцію
                path = file_search(i, filename)
                # якщо повернено рядок, отже десь в цьому напрямі було знайдено шуканий файл/папку
                if isinstance(path, str):
                    # дописуємо в початок шляху ім'я поточної папки і повертаємо "на рівень вище"
                    return folder[0] + '/' + path
                # інакше було повернено False - нічого не знайдено, шукаємо далі
            # якщо цикл пройдено і ми досі не вийшли з функції, значить нічого не знайдено, повертаємо False
            return False
        # якщо файл - далі в цьому напрямі шукати нема що, повертаємо False
        else:
            return False
